{
	tips:[
          {"freq":1.0, "tip":"[More Combat Terrain Effects] Magnetic fields significantly reduce the vision, weapon/fighter range, ECCM chance, and missile maneuverability/guidance of all ships, but they also have a chance to scramble the targetting of missiles, sending them off to chase sensor ghosts!"},
		  {"freq":0.5, "tip":"[More Combat Terrain Effects] Magnetic fields apply a moderate effect to combat-they require adjustments to strategy, but are still fair. Magnetic storms apply extreme effects-they DEFINE the battle, and force every engagement to be a knife fight."},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] Slipstreams supercharge the systems of anything inside them, giving them psuedo-safety overrides, even missiles! However, the extreme load often causes a passive buildup of hardflux."},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] Slipstreams provide enough excess power to the engines of fighters and missiles to activate their zero-flux boost. Beware of their unusually high range and speed!"},
		  {"freq":0.3, "tip":"[More Combat Terrain Effects] Slipstreams don't actually color your engines the same color as safety overrides - it's a more purple color."},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] While long-ranged sensors are unaffected by nebulae, combat-grade sensors struggle somewhat, resulting in nebulae reducing vision and weapon range somewhat of any ship inside them, alongside the gasses choking out the engines, reducing speed somewhat and disabling the zero-flux boost."},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] In combat, hyperspace clouds are similar in function to nebulae, with one major exception: If storming, they will periodically strike anything nearby with extremely powerful lightning. This lightning's effect is mitigated by solar shielding!"},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] Much like the campaign, hyperstorms in combat strike less often the smaller and slower you are!"},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] The high gravity of black holes is known to force nearby ships into a state of higher relativity. It's also known, of course, to drag things towards itself."},
		  {"freq":1.0, "tip":"[More Combat Terrain Effects] Neutron stars' jet streams are incredibly hostile environments. Anything inside of them will suffer worse shield stats, random EMP arcs, worse CR, solar winds, and all projectiles having extra EMP damage."},
		  #{"freq":1, "tip":"[More Combat Terrain Effects] Oftentimes, debris fields are the aftermath of a battle. Fighting inside them can be a challenge, what with the large ship pieces floating around, leftover munitions/mines, drones with their combat program still active..."},
		  {"freq":1.6, "tip":"[More Combat Terrain Effects] Literally EVERYTHING about this mod is configurable in MCTE_settings.json. From disabling/enabling effects individually, to tweaking their values, you have a lot of control!"},
		  {"freq":0.0001, "tip":"[More Combat Terrain Effects] Unlike \"some\" modders, I prefix my annoying tips so you know which mod needs to have tips removed!"},
    ],
}